
# З Titanic Dataset Exploration with pandas

 **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why its useful.

In [139]:
import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

##  Step 1: Inspecting the Data

### df.head() y df.tail()
Estos m茅todos son 煤tiles para extaer informaci贸n del comienzo y el final de las series o dataframes respectivamente. Se usan para hacerse una idea r谩pida sobre un dataset. Harrison prefire usar `df.sample()` para hacerse una idea m谩s real sobre los datos, ya que **las filas iniciales no suelen ser representativas**.

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
342,343,0,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
701,702,1,1,"Silverthorne, Mr. Spencer Victor",male,35.0,0,0,PC 17475,26.2875,E24,S
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
771,772,0,3,"Jensen, Mr. Niels Peder",male,48.0,0,0,350047,7.8542,NaN,S

### df.info()
Imprime por la salida estandar informaci贸n 煤til sobre el DataFrame en cuanto a estructura de datos: columnas, indices, tipos, tapa帽os etc. Un parametro importante es `memory_usage`.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 285.6 KB

### df.describe()
El m茅todo devuelve un DataFrame con informaci贸n estad铆stica de cada columna num茅rica, siendo pedantes, es una meta-agregaci贸n.

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### df.shape
Devuelve una tupla con la dimensionalidad del DataFrame.

In [9]:
df.shape

(891, 12)

### df.columns
Este atributo devuelve las etiquetas de las columnas del DataFrame.

In [50]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

##  Step 2: Selecting Data
Las Series y los DataFrames en pandas implementan el operador de indexaci贸n de python `[]`, a la vez permiten indexar contra sus atributos `loc`y `矛loc`.

### df["column"]
Uno de los m茅todos para acceder a las columnas es indexarlas directamente desde el objeto. Igualmente podemos acceder a ellas directamente c贸mo un atributo, pero unicamente si el nombre de la columna es un nombre v谩lido par aun atributo en python. **Muchas referencias recomiendan ignorar tanto las columnas c贸mo atributo c贸mo indexar directamente desde el objeto en favor de loc y iloc**.

In [51]:
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [52]:
df["Age"] #Ambos devuelven una serie

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

El operador `[]` tiene un comportamiento diferente en Series y en DataFrames, en las series apela al indice mientras que en el Frame espera el nombre de una tabla.

In [53]:
#df[4] genera un error clave no encontrada
df["Age"][4]

np.float64(35.0)

Cuando indexamos una unica columna, podemos **forzar que nos devueva un DataFrame** indexando una lista en vez de un escalar.

In [54]:
df[["Age"]] #No podr铆amos indexar c贸mo arriba

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

Podmeos indexar m谩s de una columna mediante una lista. Esta vez nos ha devuelto un dataframe no una serie, ya que tiene m谩s de una columna
.

In [55]:
df[["Age", "Sex"]]

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

### df.iloc[]
El atributo iloc nos permite extraer filas y columnas mediante su posici贸n.

In [56]:
df.iloc[4] #Es una Serie aunque es una fila!!!

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                35.0
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object

In [57]:
df.iloc[[4]] #Al indexar de nuevo sobre una lista, el objeto devuelto es un DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

Al igual que en python, podemos pasarle un "slice" o incluso una funci贸n, que reciva un DataFrame y devuelva opciones v谩lidas para 'iloc'.

In [58]:
df.iloc[0:11:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [59]:
df.iloc[(lambda df:[0,5,10])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

Y manteniendo la l贸gica de las operaciones anteriores, podemos extraer igualmente columnas.

In [60]:
df.iloc[:,[3]]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

### df.loc[]
El atributo loc nos permite indexar por el nombre del indice y de la columna. Es mportante recordar en este punto que los indices, aunque sean numericos autoincrementales, **son etiquetas no posiciones**.

In [67]:
df.loc[50:100:10, ["Name", "Sex", "Pclass"]]

                           Name     Sex  Pclass
50   Panula, Master. Juha Niilo    male       3
60        Sirayanian, Mr. Orsen    male       3
70   Jenkin, Mr. Stephen Curnow    male       2
80         Waelens, Mr. Achille    male       3
90         Christmann, Mr. Emil    male       3
100     Petranec, Miss. Matilda  female       3

Fijate que el comportamiento de `iloc` y `loc` al definir intervalos es diferente. `iloc` implementa una l贸gica de intervalo medio abierto, incluyendo el primer indice pero no el 煤ltimo; mientras que `loc`implementa un intervalo cerrado, incluyendo tanto el primer indice c贸mo el 煤ltimo. Hay excepciones c贸mo la indexaci贸n parcial que hace que esta l贸gica se sienta algo inconssitente.

In [69]:
df.iloc[50:100:10] #el mismo intervalo pero con iloc, observa la diferencia.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,C.A. 33111,10.5000,NaN,S
80,81,0,3,"Waelens, Mr. Achille",male,22.0,0,0,345767,9.0000,NaN,S
90,91,0,3,"Christmann, Mr. Emil",male,29.0,0,0,343276,8.0500,NaN,S

Podemos hacer indexaci贸n por rango en indices de strings, incluso podemos hacer una **indexaci贸n parcial**, pero los indices deben estar *ordenados*.

In [89]:
df.set_index("Embarked").sort_index().loc['C':'Q']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN
C,126,1,3,"Nicola-Yarred, Master. Elias",male,12.0,1,0,2651,11.2417,NaN
C,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN
C,353,0,3,"Elias, Mr. Tannous",male,15.0,1,1,2695,7.2292,NaN
C,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69
...,...,...,...,...,...,...,...,...,...,...,...
Q,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN
Q,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN
Q,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN
Q,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN
Q,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN

In [136]:
#Muy 煤til para seleccionar largas listas de nombres.
#Aqu铆 extraemos los apellidos de la A a la C.
#Importante destacar que se la indexaci贸n parcial excluye el ultimo indice:
#los apellidos empezados por D no aparecen.
df.set_index('Name').sort_index().loc["A":"D", "PassengerId":"Pclass"]

,PassengerId,Survived,Pclass
Name,,,
"Abbing, Mr. Anthony",846,0,3
"Abbott, Mr. Rossmore Edward",747,0,3
"Abbott, Mrs. Stanton (Rosa Hunt)",280,1,3
"Abelson, Mr. Samuel",309,0,2
"Abelson, Mrs. Samuel (Hannah Wizosky)",875,1,2
...,...,...,...
"Crosby, Capt. Edward Gifford",746,0,1
"Crosby, Miss. Harriet R",541,1,1
"Culumovic, Mr. Jeso",845,0,3
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1
"Cunningham, Mr. Alfred Fleming",414,0,2

Puedes hacer indexaci贸n parcial de columnas si las ordenas.

In [135]:
df.set_index('Name').sort_index().sort_index(axis='columns').loc["A":"B", "P":"T"].head()

,Parch,PassengerId,Pclass,Sex,SibSp,Survived
Name,,,,,,
"Abbing, Mr. Anthony",0,846,3,male,0,0
"Abbott, Mr. Rossmore Edward",1,747,3,male,1,0
"Abbott, Mrs. Stanton (Rosa Hunt)",1,280,3,female,1,1
"Abelson, Mr. Samuel",0,309,2,male,1,0
"Abelson, Mrs. Samuel (Hannah Wizosky)",0,875,2,female,1,1


##  Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

In [ ]:

# Example: Filtering data
df[df["Age"] > 50].head()
df.query("Sex == 'female' and Survived == 1").head()


## Ч Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

In [ ]:

# Example: Check missing values
df.isna().sum()

# Fill missing ages with median
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"].head()


##  Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

In [44]:

# Example: Aggregation
df.groupby("Sex")["Survived"].mean()
df.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64


##  Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

In [13]:

# Example: Sorting and counting
df.sort_values("Age").head()
df["Pclass"].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64


## 锔 Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

In [ ]:

# Example: Create new column
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()


##  Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

In [ ]:

# Example: Save cleaned data
df.to_csv("titanic_cleaned.csv", index=False)


## З Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?

### Referencias
- 芦API reference  pandas 2.3.3 documentation禄. Accedido 14 de noviembre de 2025. https://pandas.pydata.org/docs/reference/index.html.
- Harrison, Matt. Effective Pandas 2: Opinionated Patterns for Data Manipulation. Treading on Python Series. Matt Harrison, 2024.
- Hill, Christian. Learning Scientific Programming with Python. Second edition. Cambridge University Press, 2020.
- McKinney, Wes. Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython. Second edition, Fourth release. OReilly, 2018.